let answer1 = prompt("какое официальное название использует javascipt");
if (answer1 == "ECMAScript") {
  alert("правильно");
} else {
  alert("Не знаете? ECMAScript!");
}
//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//
let promtAnswer = promt("Введите любое число");
if (promtAnswer > 0) {
  alert("1");
} else if (promtAnswer < 0) {
  alert("-1");
} else {
  alert("0");
}
//
//ok
//

//
//----------------------------------------------------------------------
//
let result;
if (a + b < 4) {
  result = "Мало";
} else {
  result = "Много";
}

//|
//v

result = a + b < 4 ? "Много" : "Мало";
//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

let message;

if (login == "Сотрудник") {
  message = "Привет";
} else if (login == "Директор") {
  message = "Здравствуйте";
} else if (login == "") {
  message = "Нет логина";
} else {
  message = "";
}

//|
//v

message =
  login == "Сотрудник"
    ? (message = "Привет")
    : login == "Директор"
    ? (message = "Здравствуйте")
    : login == ""
    ? (message = "Нет логина")
    : (message = "");

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//
