let admin, name;
name = "Джон";
admin = name;
alert(admin);

let planet, userName;

const BIRTHDAY = "18.04.1982";

const ageConst = someCode(BIRTHDAY);

let name1 = `ilya`;

alert(`hello${1}`);
alert(`hello${"name"}`);
alert(`hello${name1} and ${name}`);

let age = prompt("Как тебя зовут?", "неизвестно");

alert(`Тебя зовут: ${age}`);

let a = 1,
  b = 1;

let c = ++a; // ? 2
let d = b++; // ? 1

//
//----------------------------------------------------------------------
//

"" + 1 + 0; // 10 string
"" - 1 + 0; // -1
true + false; // 1
6 / "3"; // 2
"2" * "3"; // 6
4 + 5 + "px"; // 9px string
"$" + 4 + 5; //$45
"4" - 2; // 2
"4px" - 2; // NaN
"  -9  " + 5; // " -9  5"
"  -9  " - 5; // -14
null + 1; // 1
undefined + 1; // Nan
" \t \n" - 2; //-2

//
//10 из 14 правильно
//

//
//----------------------------------------------------------------------
//

// let A = promt("Первое число",1)
// let B = promt("Второе число",2)
// alert(A+B)

let A = promt("Первое число", 1);
let B = promt("Второе число", 2);
alert(+A + +B);

//
//Правильно
//

//
//----------------------------------------------------------------------
//

5 > 4; // true
"ананас" > "яблоко"; // false
"2" > "12"; //true
undefined == null; //true
undefined === null; //false
null == "\n0\n"; //false
null === +"\n0\n"; //false

//
//2 неправильно
//

//
//----------------------------------------------------------------------
//

if ("0") {
  alert("Привет");
}
// выведет алерт потому что любая строка приравнивается к true

//
//----------------------------------------------------------------------
//

alert(Boolean("непустая строка")); // true ВАЖНО!!!

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

alert(null || 2 || undefined); //2

alert(alert(1) || 2 || alert(3)); // 1 // 2

alert(1 && null && 2); // null

alert(alert(1) && alert(2)); // 1 //undefiend

alert(null || (2 && 3) || 4); // 3

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

let value = NaN;

value &&= 10; // NaN
value ||= 20; //20
value &&= 30; //30
value ||= 40; // 30

alert(value); //30

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

let age1;
prompt("введите свой возраст", age1);
if (!(age1 >= 14 && age1 <= 90)) {
  console.log("Возраст в диапазоне между 14 и 90 включительно");
}

if (age1 <= 14 && age1 >= 90) {
  console.log("Возраст в диапазоне между 14 и 90 включительно");
}

//Правильно

//
//----------------------------------------------------------------------
//

//
//----------------------------------------------------------------------
//

if (-1 || 0) alert("first"); // first
if (-1 && 0) alert("second"); // Не выведет
if (null || (-1 && 1)) alert("third"); // third

//Правильно

//
//----------------------------------------------------------------------
//
let login;
let pass;
promt("Введите логин", login);
if (login === null || login === "") {
  alert("Отменено");
} else if (login != "Админ") {
  alert("Я вас не знаю");
} else {
  prompt("Введите пароль", pass);
  if (login === null || login === "") {
    alert("Отменено");
  } else if (pass != "Я главный") {
    alert("Я вас не знаю");
  } else {
    alert("Здравствуйте!");
  }
}

//
//----------------------------------------------------------------------
//
